const countryArr = [
  {
    "id": 1,
    "countryId": -1,
    "label": "新亚欧大陆桥",
    "children": [
      {
        "id": "101",
        "countryId": "1",
        "label": "哈萨克斯坦"
      },
      {
        "id": "102",
        "countryId": "2",
        "label": "俄罗斯"
      },
      {
        "id": "103",
        "countryId": "3",
        "label": "乌克兰"
      },
      {
        "id": "104",
        "countryId": "4",
        "label": "白俄罗斯"
      },
      {
        "id": "105",
        "countryId": "5",
        "label": "格鲁吉亚"
      },
      {
        "id": "106",
        "countryId": "6",
        "label": "阿塞拜疆"
      },
      {
        "id": "107",
        "countryId": "7",
        "label": "亚美尼亚"
      },
      {
        "id": "108",
        "countryId": "8",
        "label": "摩尔多瓦"
      },
      {
        "id": "109",
        "countryId": "9",
        "label": "波兰"
      },
      {
        "id": "110",
        "countryId": "10",
        "label": "立陶宛"
      },
      {
        "id": "111",
        "countryId": "11",
        "label": "爱沙尼亚"
      },
      {
        "id": "112",
        "countryId": "12",
        "label": "拉脱维亚"
      },
      {
        "id": "113",
        "countryId": "13",
        "label": "捷克"
      },
      {
        "id": "114",
        "countryId": "14",
        "label": "斯洛伐克"
      },
      {
        "id": "115",
        "countryId": "15",
        "label": "匈牙利"
      },
      {
        "id": "116",
        "countryId": "16",
        "label": "斯洛文尼亚"
      },
      {
        "id": "117",
        "countryId": "17",
        "label": "克罗地亚"
      },
      {
        "id": "118",
        "countryId": "18",
        "label": "波黑"
      },
      {
        "id": "119",
        "countryId": "19",
        "label": "塞尔维亚"
      },
      {
        "id": "120",
        "countryId": "20",
        "label": "阿尔巴尼亚"
      },
      {
        "id": "121",
        "countryId": "21",
        "label": "罗马尼亚"
      },
      {
        "id": "122",
        "countryId": "22",
        "label": "保加利亚"
      },
      {
        "id": "123",
        "countryId": "23",
        "label": "北马其顿"
      }
    ]
  },
  {
    "id": 2,
    "countryId": -1,
    "label": "中国—中亚—西亚经济走廊",
    "children": [
      {
        "id": "201",
        "countryId": "24",
        "label": "哈萨克斯坦"
      },
      {
        "id": "202",
        "countryId": "25",
        "label": "乌兹别克斯坦"
      },
      {
        "id": "203",
        "countryId": "26",
        "label": "土库曼斯坦"
      },
      {
        "id": "204",
        "countryId": "27",
        "label": "塔吉克斯坦"
      },
      {
        "id": "205",
        "countryId": "28",
        "label": "吉尔吉斯斯坦"
      },
      {
        "id": "206",
        "countryId": "29",
        "label": "伊朗"
      },
      {
        "id": "207",
        "countryId": "30",
        "label": "伊拉克"
      },
      {
        "id": "208",
        "countryId": "31",
        "label": "土耳其"
      },
      {
        "id": "209",
        "countryId": "32",
        "label": "叙利亚"
      },
      {
        "id": "210",
        "countryId": "33",
        "label": "约旦"
      },
      {
        "id": "211",
        "countryId": "34",
        "label": "黎巴嫩"
      },
      {
        "id": "212",
        "countryId": "35",
        "label": "以色列"
      },
      {
        "id": "213",
        "countryId": "36",
        "label": "沙特阿拉伯"
      },
      {
        "id": "214",
        "countryId": "37",
        "label": "也门"
      },
      {
        "id": "215",
        "countryId": "38",
        "label": "阿曼"
      },
      {
        "id": "216",
        "countryId": "39",
        "label": "阿联酋"
      },
      {
        "id": "217",
        "countryId": "40",
        "label": "卡塔尔"
      },
      {
        "id": "218",
        "countryId": "41",
        "label": "科威特"
      },
      {
        "id": "219",
        "countryId": "42",
        "label": "巴林"
      },
      {
        "id": "220",
        "countryId": "43",
        "label": "希腊"
      },
      {
        "id": "221",
        "countryId": "44",
        "label": "塞浦路斯"
      },
      {
        "id": "222",
        "countryId": "45",
        "label": "埃及"
      }
    ]
  },
  {
    "id": 3,
    "countryId": -1,
    "label": "中巴",
    "children": [
      {
        "id": "301",
        "countryId": "46",
        "label": "巴基斯坦"
      }
    ]
  },
  {
    "id": 4,
    "countryId": -1,
    "label": "中蒙俄",
    "children": [
      {
        "id": "401",
        "countryId": "47",
        "label": "俄罗斯"
      },
      {
        "id": "402",
        "countryId": "48",
        "label": "蒙古"
      }
    ]
  },
  {
    "id": 5,
    "countryId": -1,
    "label": "中国—中南半岛",
    "children": [
      {
        "id": "501",
        "countryId": "49",
        "label": "越南"
      },
      {
        "id": "502",
        "countryId": "50",
        "label": "老挝"
      },
      {
        "id": "503",
        "countryId": "51",
        "label": "柬埔寨"
      },
      {
        "id": "504",
        "countryId": "52",
        "label": "缅甸"
      },
      {
        "id": "505",
        "countryId": "53",
        "label": "泰国"
      },
      {
        "id": "506",
        "countryId": "54",
        "label": "新加坡"
      },
      {
        "id": "507",
        "countryId": "55",
        "label": "马来西亚"
      }
    ]
  },
  {
    "id": 6,
    "countryId": -1,
    "label": "孟中印缅",
    "children": [
      {
        "id": "601",
        "countryId": "56",
        "label": "印度"
      },
      {
        "id": "602",
        "countryId": "57",
        "label": "孟加拉"
      },
      {
        "id": "603",
        "countryId": "58",
        "label": "缅甸"
      }
    ]
  },
  {
    "id": 7,
    "countryId": -1,
    "label": "21世纪海上丝绸之路",
    "children": [
      {
        "id": "701",
        "countryId": "59",
        "label": "印度尼西亚"
      },
      {
        "id": "702",
        "countryId": "60",
        "label": "马来西亚"
      },
      {
        "id": "703",
        "countryId": "61",
        "label": "菲律宾"
      },
      {
        "id": "704",
        "countryId": "62",
        "label": "新加坡"
      },
      {
        "id": "705",
        "countryId": "63",
        "label": "泰国"
      },
      {
        "id": "706",
        "countryId": "64",
        "label": "文莱"
      },
      {
        "id": "707",
        "countryId": "65",
        "label": "越南"
      },
      {
        "id": "708",
        "countryId": "66",
        "label": "老挝"
      },
      {
        "id": "709",
        "countryId": "67",
        "label": "缅甸"
      },
      {
        "id": "710",
        "countryId": "68",
        "label": "柬埔寨"
      },
      {
        "id": "711",
        "countryId": "69",
        "label": "印度"
      },
      {
        "id": "712",
        "countryId": "70",
        "label": "巴基斯坦"
      },
      {
        "id": "713",
        "countryId": "71",
        "label": "孟加拉"
      },
      {
        "id": "714",
        "countryId": "72",
        "label": "阿富汗"
      },
      {
        "id": "715",
        "countryId": "73",
        "label": "斯里兰卡"
      },
      {
        "id": "716",
        "countryId": "74",
        "label": "马尔代夫"
      },
      {
        "id": "717",
        "countryId": "75",
        "label": "尼泊尔"
      },
      {
        "id": "718",
        "countryId": "76",
        "label": "埃及"
      },
      {
        "id": "719",
        "countryId": "77",
        "label": "希腊"
      }
    ]
  }
]
const countryDetail = {
  name: "俄罗斯",
  zlly: "资料来源：对外投资合作国别(地区)指南-俄罗斯（2015版）；商务部",
  info: [{
      key: '行政规划',
      value: `据俄罗斯的宪法，俄罗斯联邦现由85个平等的联邦主体组成，其中包括22个共和国、9个边疆区、46个州、2个联邦直辖市、1个自治州和4个民族自治区。
        
        为维护国家统一，强化总统对地方的管理，俄罗斯联邦主体按地域原则划分为8个联邦区。俄罗斯的首都为莫斯科。`,
    },
    {
      key: '地理环境',
      value: `俄罗斯地跨欧亚两洲，位于欧洲东部和亚洲大陆的北部，其欧洲领土的大部分是东欧平原。北邻北冰洋，东濒太平洋，西接大西洋，西北临波罗的海、芬兰湾。

        俄罗斯以平原和高原为主的地形。地势南高北低，西低东高。
        
        大部分地区处于北温带，气候多样，以温带大陆性气候为主，但北极圈以北属于寒带气候，西伯利亚就属于高纬度地区，气候寒冷，冬季漫长，但夏季日照时间长，气温和湿度适宜，利于针叶林生长。`,
    },
    {
      key: '国家特征',
      value: `俄罗斯国旗采用传统的泛斯拉夫色，旗面由三个平行且相等的横长方形组成，由上到下依次是白、蓝、红三色。

        俄罗斯国徽，红色盾面上有一只金色的双头鹰，鹰头上是彼得大帝的三顶皇冠，鹰爪抓着象征皇权的权杖和金球。鹰胸前是一个小盾形，上面是一名骑士和一匹白马。`,
    },
    {
      key: '人口',
      value: "截止2014年1月1日，俄罗斯人口为1.44亿，其中城市人口1.07亿（74%），农村人口0.37亿（26%）；男性占46%，女性占54%。",
    },
    {
      key: '经济',
      value: `2014年，受国际原油价格下跌和美西方制裁影响，俄经济遭遇2008年以来最严重困难。卢布大幅贬值，企业融资困难，资本加速外逃。俄政府积极应对，出台包括动用外汇储备、增加市场美元流动性、严打金融投机行为、动用预算资金支持实体经济等在内的一系列救市措施，卢布汇率日趋稳定，社会形势和民众情绪基本稳定。但俄罗斯重工业发达，核工业和航空航天业占世界重要地位。俄自然资源十分丰富，种类多，储量大，自给程度高。`,
    },
    {
      key: '交通运输',
      value: `各类运输方式俱全，铁路、公路、水运、航空都起着重要作用。

        铁路：截至2013年底，俄铁路网总运营里程为8.6万公里
        
        公路：截至2013年底，俄公路网总里程139.4万公里。
        
        水运：俄罗斯内河通航里程为10.17万公里。主要海港位于波罗的海、黑海等。
        
        空运：现有航空公司46家，其中年运力超过100万人次的大型航空公司11家。
        
        管道运输：截至2013年底，俄石油、天然气输送管道总长25万公里。`,
    },
    {
      key: '外交',
      value: `开展全方位外交，以独联体为战略重点，以与西方关系、特别是与欧洲关系为优先，同时加强亚太外交，加大对中、印等亚太大国的借重。其宗旨是积极推动多极化进程，力主重振俄大国地位，突出维护国家利益，着眼点是为俄国内经济复兴创造有利的外部条件。

        1949年10月2日，苏联是世界上第一个与新中国建交的国家。苏联解体后，1991年12月27日，确认俄继承苏联与中国的外交关系。`,
    },
    {
      key: '文化',
      value: `全国有193个民族，其中俄罗斯族占77.7%，主要少数民族有鞑靼族、乌克兰族、楚瓦什族、巴什基尔族等。主要语言为俄语。俄罗斯联邦境内宗教主要有基督教、伊斯兰教、萨满教、佛教（喇嘛教）和犹太教等。

        重要节日具体如下：
        
        公历新年，1月1日；东正教圣诞节，1月7日；祖国保卫者日，2月23日；伟大卫国战争胜利日，5月9日；国庆日（国家主权宣言通过日），6月12日；人民团结日，11月4日。`,
    }
  ],
}

export {
    countryArr,
    countryDetail
}
